# Missing Data in Pandas

### None: Pythonic missing data

In [2]:
 import numpy as np
 import pandas as pd

In [3]:
vals1 = np.array([1, None, 3, 4])

vals1

array([1, None, 3, 4], dtype=object)

In [4]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
46.1 ms ± 3.2 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
1.65 ms ± 76.4 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [5]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

# NaN: Missing numerical data

In [7]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [8]:
1 + np.nan

nan

In [9]:
0 * np.nan

nan

In [10]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [11]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [12]:
'''Keep in mind that NaN is specifically a floating-point value; there is no equivalent
NaN value for integers, strings, or other types.'''

'Keep in mind that NaN is specifically a floating-point value; there is no equivalent\nNaN value for integers, strings, or other types.'

# NaN and None in Pandas

In [13]:
 pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [14]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [15]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

# Operating on Null Values:

## Detecting null values

In [17]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [18]:
 data[data.notnull()]

0        1
2    hello
dtype: object

In [19]:
 data.dropna()

0        1
2    hello
dtype: object

In [20]:
 df = pd.DataFrame([[1, np.nan, 2],
 [2, 3, 5],
 [np.nan, 4, 6]])
 df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [21]:
 df.dropna()

     0    1  2
1  2.0  3.0  5

In [22]:
 df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [23]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [24]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [25]:
 df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [26]:
 data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
 data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [27]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [28]:
 # forward-fill
 data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [29]:
 # back-fill
 data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [31]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [30]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0